MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM342FYXBG/mcu.h
/**
 *******************************************************************************
 * @file    TMPM342.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM342' Device Series
 * @version V2.0.2.1 (Tentative)
 * @date    2011/04/12
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2011 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */

/** @addtogroup TMPM342
  * @{
  */

#ifndef __TMPM342_H__
#define __TMPM342_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M3 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M3 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M3 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M3 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M3 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M3 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M3 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M3 System Tick Interrupt                          */

/******  TMPM342 Specific Interrupt Numbers *******************************************************************/
  INT0_IRQn                     = 0,         /*!< Interrupt pin 0                                             */
  INT1_IRQn                     = 1,         /*!< Interrupt pin 1                                             */
  INT2_IRQn                     = 2,         /*!< Interrupt pin 2                                             */
  INT3_IRQn                     = 3,         /*!< Interrupt pin 3                                             */
  INT4_IRQn                     = 4,         /*!< Interrupt pin 4                                             */
  INT5_IRQn                     = 5,         /*!< Interrupt pin 5                                             */
  INT6_IRQn                     = 6,         /*!< Interrupt pin 6                                             */
  INT7_IRQn                     = 7,         /*!< Interrupt pin 7                                             */
  INTPSCSTOP_IRQn               = 8,         /*!< PSC end interrupt                                           */
  INTPSCBRK_IRQn                = 9,         /*!< PSC break interrupt                                         */
  INTPSCSTEP_IRQn               = 10,        /*!< PSC step interrupt                                          */
  INTPSCII_IRQn                 = 11,        /*!< PSC unjustified instruction interrupt                       */
  INTPSCIA_IRQn                 = 12,        /*!< PSC unjustified address interrupt                           */
  INTTB0_IRQn                   = 13,        /*!< 16-bit TMRB match detection 0                               */
  INTTB1_IRQn                   = 14,        /*!< 16-bit TMRB match detection 1                               */
  INTTB2_IRQn                   = 15,        /*!< 16-bit TMRB match detection 2                               */
  INTTX0_IRQn                   = 16,        /*!< Serial transmission (channel.0)                             */
  INTRX0_IRQn                   = 17,        /*!< Serial reception (channel.0)                                */
  INTTX1_IRQn                   = 18,        /*!< Serial transmission (channel.1)                             */
  INTRX1_IRQn                   = 19,        /*!< Serial reception (channel.1)                                */
  INTTX2_IRQn                   = 20,        /*!< Serial transmission (channel.2)                             */
  INTRX2_IRQn                   = 21,        /*!< Serial reception (channel.2)                                */
  INTTX3_IRQn                   = 22,        /*!< Serial transmission (channel.3)                             */
  INTS_IRQn                     = 23,        /*!< UART sending and receiving interrupt                        */
  INTAD0HP_IRQn                 = 24,        /*!< Top priority ADC0 conversion end interrupt                  */
  INTAD0_IRQn                   = 25,        /*!< ADC0 conversion end interrupt usually                       */
  INTAD1HP_IRQn                 = 26,        /*!< Top priority ADC1 conversion end interrupt                  */
  INTAD1_IRQn                   = 27,        /*!< ADC1 conversion end interrupt usually                       */
  INTDSADHP_IRQn                = 28,        /*!< Top priority ADC conversion end interrupt               */
  INTDSAD_IRQn                  = 29,        /*!< ADC conversion end interrupt usually                    */
  INTI2C_IRQn                   = 30,        /*!< I2C interrupt                                               */
  INTTB3_IRQn                   = 31,        /*!< 16-bit TMRB match detection 3                               */
  INTTB4_IRQn                   = 32,        /*!< 16-bit TMRB match detection 4                               */
  INTTB5_IRQn                   = 33,        /*!< 16-bit TMRB match detection 5                               */
  INTTB6_IRQn                   = 34,        /*!< 16-bit TMRB match detection 6                               */
  INTTB7_IRQn                   = 35,        /*!< 16-bit TMRB match detection 7                               */
  INTTB8_IRQn                   = 36,        /*!< 16-bit TMRB match detection 8                               */
  INTTB9_IRQn                   = 37,        /*!< 16-bit TMRB match detection 9                               */
  INTTD0CMP0_IRQn               = 38,        /*!< 16-bit TMRD0 compare interrupt 0                            */
  INTTD0CMP1_IRQn               = 39,        /*!< 16-bit TMRD0 compare interrupt 1                            */
  INTTD0CMP2_IRQn               = 40,        /*!< 16-bit TMRD0 compare interrupt 2                            */
  INTTD0CMP3_IRQn               = 41,        /*!< 16-bit TMRD0 compare interrupt 3                            */
  INTTD0CMP4_IRQn               = 42,        /*!< 16-bit TMRD0 compare interrupt 4                            */
  INTTD1CMP0_IRQn               = 43,        /*!< 16-bit TMRD1 compare interrupt 0                            */
  INTTD1CMP1_IRQn               = 44,        /*!< 16-bit TMRD1 compare interrupt 1                            */
  INTTD1CMP2_IRQn               = 45,        /*!< 16-bit TMRD1 compare interrupt 2                            */
  INTTD1CMP3_IRQn               = 46,        /*!< 16-bit TMRD1 compare interrupt 3                            */
  INTTD1CMP4_IRQn               = 47,        /*!< 16-bit TMRD1 compare interrupt 4                            */
  INTTD2CMP0_IRQn               = 48,        /*!< 16-bit TMRD2 compare interrupt 0                            */
  INTTD2CMP1_IRQn               = 49,        /*!< 16-bit TMRD2 compare interrupt 1                            */
  INTTD2CMP2_IRQn               = 50,        /*!< 16-bit TMRD2 compare interrupt 2                            */
  INTTD2CMP3_IRQn               = 51,        /*!< 16-bit TMRD2 compare interrupt 3                            */
  INTTD2CMP4_IRQn               = 52,        /*!< 16-bit TMRD2 compare interrupt 4                            */
  INTTD3CMP0_IRQn               = 53,        /*!< 16-bit TMRD3 compare interrupt 0                            */
  INTTD3CMP1_IRQn               = 54,        /*!< 16-bit TMRD3 compare interrupt 1                            */
  INTTD3CMP2_IRQn               = 55,        /*!< 16-bit TMRD3 compare interrupt 2                            */
  INTTD3CMP3_IRQn               = 56,        /*!< 16-bit TMRD3 compare interrupt 3                            */
  INTTD3CMP4_IRQn               = 57,        /*!< 16-bit TMRD3 compare interrupt 4                            */
  INTEC0_IRQn                   = 58,        /*!< PHC0 comparison interrupt                                   */
  INTEC0OVF_IRQn                = 59,        /*!< PHC0 overflow interrupt                                     */
  INTEC0DIR_IRQn                = 60,        /*!< PHC0 phase error interrupt                                  */
  INTEC0DT0_IRQn                = 61,        /*!< PHC0 cycle0 interrupt                                       */
  INTEC0DT1_IRQn                = 62,        /*!< PHC0 cycle1 interrupt                                       */
  INTEC0DT2_IRQn                = 63,        /*!< PHC0 cycle2 interrupt                                       */
  INTEC0DT3_IRQn                = 64,        /*!< PHC0 cycle3 interrupt                                       */
  INTEC1_IRQn                   = 65,        /*!< PHC1 comparison interrupt                                   */
  INTEC1OVF_IRQn                = 66,        /*!< PHC1 overflow interrupt                                     */
  INTEC1DIR_IRQn                = 67,        /*!< PHC1 phase error interrupt                                  */
  INTEC1DT0_IRQn                = 68,        /*!< PHC1 cycle0 interrupt                                       */
  INTEC1DT1_IRQn                = 69,        /*!< PHC1 cycle1 interrupt                                       */
  INTEC1DT2_IRQn                = 70,        /*!< PHC1 cycle2 interrupt                                       */
  INTEC1DT3_IRQn                = 71,        /*!< PHC1 cycle3 interrupt                                       */
  INTAD0M0_IRQn                 = 72,        /*!< AD0 conversion monitoring function interrupt 0              */
  INTAD0M1_IRQn                 = 73,        /*!< AD0 conversion monitoring function interrupt 1              */
  INTAD1M0_IRQn                 = 74,        /*!< AD1 conversion monitoring function interrupt 0              */
  INTAD1M1_IRQn                 = 75,        /*!< AD1 conversion monitoring function interrupt 1              */
  INTDMAC0TC_IRQn               = 76,        /*!< DMA terminal count status interrupt 0                       */
  INTDMAC0ERR_IRQn              = 77,        /*!< DMA error status interrupt 0                                */
  INTDMAC1TC_IRQn               = 78,        /*!< DMA terminal count status interrupt 1                       */
  INTDMAC1ERR_IRQn              = 79,        /*!< DMA error status interrupt 1                                */
  INTSSP_IRQn                   = 80,        /*!< SSP serial interface                                        */
  INTVTX_IRQn                   = 81,        /*!< VSIO transmission                                           */
  INTVRX_IRQn                   = 82,        /*!< VSIO reception                                              */
  INT8_IRQn                     = 84,        /*!< Interrupt pin 8                                             */
  INT9_IRQn                     = 85,        /*!< Interrupt pin 9                                             */
  INTA_IRQn                     = 86,        /*!< Interrupt pin A                                             */
} IRQn_Type;

