MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM342FYXBG/mcu.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __CM3_REV              0x0200       /*!< Cortex-M3 Core Revision                           */
#define __MPU_PRESENT             0         /*!< MPU present or not                                */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels           */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used      */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                       /* Cortex-M3 processor and core peripherals            */
// Note: Changed for MikroE implementation.
// #include "system_TMPM342.h"                 /* TMPM342 System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief DMA Controller
  */
typedef struct
{
  __I  uint32_t INTSTATUS;
  __I  uint32_t INTTCSTATUS;
  __O  uint32_t INTTCCLEAR;
  __I  uint32_t INTERRORSTATUS;
  __O  uint32_t INTERRCLR;
  __I  uint32_t RAWINTTCSTATUS;
  __I  uint32_t RAWINTERRORSTATUS;
  __I  uint32_t ENBLDCHNS;
  __IO uint32_t SOFTBREQ;
  __IO uint32_t SOFTSREQ;
       uint32_t RESERVED0[2];
  __IO uint32_t CONFIGURATION;
       uint32_t RESERVED1[51];
  __IO uint32_t C0SRCADDR;
  __IO uint32_t C0DESTADDR;
  __IO uint32_t C0LLI;
  __IO uint32_t C0CNTROL;
  __IO uint32_t C0CONFIGURATION;
       uint32_t RESERVED2[3];
  __IO uint32_t C1SRCADDR;
  __IO uint32_t C1DESTADDR;
  __IO uint32_t C1LLI;
  __IO uint32_t C1CONTROL;
  __IO uint32_t C1CONFIGURATION;
} TSB_DMAC_TypeDef;

/**
  * @brief Programmable Servo Cont
  */
typedef struct
{
  __IO uint32_t UA0;
  __IO uint32_t UM0;
  __IO uint32_t UM1;
  __IO uint32_t UL0;
  __IO uint32_t UL1;
  __IO uint32_t UR0;
  __IO uint32_t UR1;
  __IO uint32_t SGN;
  __IO uint32_t AP0;
  __IO uint32_t AP1;
  __IO uint32_t AP2;
  __IO uint32_t BR0;
  __IO uint32_t PG0;
  __IO uint32_t VG0;
       uint32_t RESERVED0[50];
  __IO uint32_t PSCCNT;
  __IO uint32_t PSCFLG;
} TSB_PSC_TypeDef;

/**
  * @brief Syncronous Serial Port
  */
typedef struct
{
  __IO uint32_t CR0;
  __IO uint32_t CR1;
  __IO uint32_t DR;
  __I  uint32_t SR;
  __IO uint32_t CPSR;
  __IO uint32_t IMSC;
  __I  uint32_t RIS;
  __I  uint32_t MIS;
  __O  uint32_t ICR;
  __IO uint32_t DMACR;
} TSB_SSP_TypeDef;

#if defined ( __CC_ARM   )           /* RealView Compiler */
#pragma anon_unions
#elif (defined (__ICCARM__))         /*  ICC Compiler     */
#pragma language=extended
#endif

/**
  * @brief UART(PL011)
  */
typedef struct
{
  __IO uint32_t DR;
union {
  __I  uint32_t SR;
  __O  uint32_t ECR;
  };
       uint32_t RESERVED0[4];
  __I  uint32_t FR;
       uint32_t RESERVED1[2];
  __IO uint32_t IBRD;
  __IO uint32_t FBRD;
  __IO uint32_t LCR_H;
  __IO uint32_t CR;
  __IO uint32_t IFLS;
  __IO uint32_t IMSC;
  __I  uint32_t RIS;
  __I  uint32_t MIS;
  __O  uint32_t ICR;
  __IO uint32_t DMACR;
} TSB_UART_TypeDef;

/**
  * @brief 12-bit AD converter
  */
typedef struct
{
  __IO uint32_t CLK;
  __IO uint32_t MOD0;
  __IO uint32_t MOD1;
  __IO uint32_t MOD2;
  __IO uint32_t MOD3;
  __IO uint32_t MOD4;
  __I  uint32_t MOD5;
  __IO uint32_t MOD6;
  __IO uint32_t MOD7;
  __IO uint32_t CMPCR0;
  __IO uint32_t CMPCR1;
  __IO uint32_t CMP0;
  __IO uint32_t CMP1;
  __I  uint32_t REG0;
  __I  uint32_t REG1;
  __I  uint32_t REG2;
  __I  uint32_t REG3;
  __I  uint32_t REG4;
  __I  uint32_t REG5;
  __I  uint32_t REG6;
  __I  uint32_t REG7;
       uint32_t RESERVED0[8];
  __I  uint32_t REGSP;
} TSB_AD_TypeDef;

/**
  * @brief 10-bit DA converter
  */
typedef struct
{
  __IO uint32_t CTL;
  __IO uint32_t REG;
} TSB_DA_TypeDef;

/**
  * @brief Timer D-common
  */
typedef struct
{
       uint32_t RESERVED0[16];
  __IO uint32_t BCR;
       uint32_t RESERVED1[3];
  __IO uint32_t EN;
  __IO uint32_t CONF;
} TSB_TD_TypeDef;

/**
  * @brief Timer D-unit0
  */
typedef struct
{
  __IO uint32_t RUN;
  __IO uint32_t CR;
  __IO uint32_t MOD;
  __IO uint32_t DMA;
       uint32_t RESERVED0;
  __IO uint32_t RG0;
  __IO uint32_t RG1;
  __IO uint32_t RG2;
  __IO uint32_t RG3;
  __IO uint32_t RG4;
  __IO uint32_t RG5;
       uint32_t RESERVED1[58];
  __I  uint32_t CP0;
  __I  uint32_t CP1;
  __I  uint32_t CP2;
  __I  uint32_t CP3;
  __I  uint32_t CP4;
  __I  uint32_t CP5;
} TSB_TD0_TypeDef;

/**
  * @brief Timer D-unit1
  */
typedef struct
{
       uint32_t RESERVED0[11];
  __IO uint32_t RG0;
  __IO uint32_t RG1;
  __IO uint32_t RG2;
  __IO uint32_t RG3;
  __IO uint32_t RG4;
       uint32_t RESERVED1[48];
  __IO uint32_t RUN;
  __IO uint32_t CR;
  __IO uint32_t MOD;
  __IO uint32_t DMA;
       uint32_t RESERVED2[7];
  __I  uint32_t CP0;
  __I  uint32_t CP1;
  __I  uint32_t CP2;
  __I  uint32_t CP3;
  __I  uint32_t CP4;
} TSB_TD1_TypeDef;

/**
  * @brief Two aspect pulse input counter
  */
typedef struct
{
  __IO uint32_t EN;
  __IO uint32_t CNT;
  __IO uint32_t IE;
  __IO uint32_t FLG;
  __IO uint32_t ARUN;
  __IO uint32_t ACP0;
  __IO uint32_t ACP1;
  __IO uint32_t ADAT;
  __IO uint32_t BRUN;
  __IO uint32_t BDMA;
  __I  uint32_t BUC;
       uint32_t RESERVED0;
  __I  uint32_t BCAP00;
  __I  uint32_t BCAP10;
  __I  uint32_t BCAP20;
  __I  uint32_t BCAP30;
  __I  uint32_t B0DAT;
  __I  uint32_t B1DAT;
  __I  uint32_t B2DAT;
  __I  uint32_t B3DAT;
  __I  uint32_t BCDAT;
       uint32_t RESERVED1[3];
  __I  uint32_t B0PDT;
  __I  uint32_t B1PDT;
  __I  uint32_t B2PDT;
  __I  uint32_t B3PDT;
} TSB_ENC_TypeDef;

/**
  * @brief Changeable data length cereal(SIO)
  */
typedef struct
{
  __IO uint32_t EN;
  __IO uint32_t BUF;
  __IO uint32_t CR0;
  __IO uint32_t CR1;
  __IO uint32_t CR2;
  __IO uint32_t CR3;
  __IO uint32_t BRCR;
  __IO uint32_t RFC;
  __IO uint32_t TFC;
  __I  uint32_t RST;
  __I  uint32_t TST;
} TSB_VSIO_TypeDef;

/**
  * @brief 16-bit Deita sigma AD converter
  */
typedef struct
{
  __IO uint32_t DSCLK;
  __IO uint32_t DSMOD0;
  __IO uint32_t DSMOD1;
  __IO uint32_t DSMOD2;
  __IO uint32_t DSMOD3;
  __IO uint32_t DSMOD4;
  __I  uint32_t DSMOD5;
  __O  uint32_t DSMOD6;
  __IO uint32_t DSMOD7;
  __IO uint32_t DSMOD8;
       uint32_t RESERVED0[54];
  __I  uint32_t DSREG0;
  __I  uint32_t DSREG1;
  __I  uint32_t DSREG2;
  __I  uint32_t DSREG3;
  __I  uint32_t DSREG4;
  __I  uint32_t DSREG5;
       uint32_t RESERVED1[58];
  __I  uint32_t DSREGSP;
       uint32_t RESERVED2[831];
  __IO uint32_t DSTEST0;
} TSB_DSAD_TypeDef;

/**
  * @brief 12-bit AD converter Mirror
  */
typedef struct
{
       uint32_t RESERVED0[13];
  __I  uint32_t REG0;
  __I  uint32_t REG1;
  __I  uint32_t REG2;
  __I  uint32_t REG3;
  __I  uint32_t REG4;
  __I  uint32_t REG5;
  __I  uint32_t REG6;
  __I  uint32_t REG7;
       uint32_t RESERVED1[8];
  __I  uint32_t REGSP;
} TSB_AD_MIR_TypeDef;

/**
  * @brief Two aspect pulse input counter Mirror
  */
typedef struct
{
       uint32_t RESERVED0[7];
  __I  uint32_t ADAT;
       uint32_t RESERVED1[2];
  __I  uint32_t BUC;
       uint32_t RESERVED2;
  __I  uint32_t BCAP00;
  __I  uint32_t BCAP10;
  __I  uint32_t BCAP20;
  __I  uint32_t BCAP30;
  __I  uint32_t B0DAT;
  __I  uint32_t B1DAT;
  __I  uint32_t B2DAT;
  __I  uint32_t B3DAT;
  __I  uint32_t BCDAT;
       uint32_t RESERVED3[3];
  __I  uint32_t B0PDT;
  __I  uint32_t B1PDT;
  __I  uint32_t B2PDT;
  __I  uint32_t B3PDT;
} TSB_ENC_MIR_TypeDef;

/**
  * @brief Port A
  */
typedef struct
{
  __IO uint32_t DATA;
  __IO uint32_t CR;
  __IO uint32_t FR1;
  __IO uint32_t FR2;
       uint32_t RESERVED0[6];
  __IO uint32_t OD;
  __IO uint32_t PUP;
       uint32_t RESERVED1[2];
  __IO uint32_t IE;
} TSB_PA_TypeDef;

/**
  * @brief Port B
  */
typedef struct
{
  __IO uint32_t DATA;
  __IO uint32_t CR;
  __IO uint32_t FR1;
  __IO uint32_t FR2;
       uint32_t RESERVED0[6];
  __IO uint32_t OD;
  __IO uint32_t PUP;
       uint32_t RESERVED1[2];
  __IO uint32_t IE;
} TSB_PB_TypeDef;

/**
  * @brief Port C
  */
typedef struct
{
  __IO uint32_t DATA;
  __IO uint32_t CR;
  __IO uint32_t FR1;
  __IO uint32_t FR2;
       uint32_t RESERVED0[6];
  __IO uint32_t OD;
  __IO uint32_t PUP;
       uint32_t RESERVED1[2];
  __IO uint32_t IE;
} TSB_PC_TypeDef;

/**
  * @brief Port D
  */
typedef struct
{
  __IO uint32_t DATA;
  __IO uint32_t CR;
  __IO uint32_t FR1;
  __IO uint32_t FR2;
       uint32_t RESERVED0[6];
  __IO uint32_t OD;
  __IO uint32_t PUP;
       uint32_t RESERVED1[2];
  __IO uint32_t IE;
} TSB_PD_TypeDef;

/**
  * @brief Port E
  */
typedef struct
{
  __IO uint32_t DATA;
  __IO uint32_t CR;
  __IO uint32_t FR1;
  __IO uint32_t FR2;
       uint32_t RESERVED0[6];
  __IO uint32_t OD;
  __IO uint32_t PUP;
       uint32_t RESERVED1[2];
  __IO uint32_t IE;
} TSB_PE_TypeDef;

/**
  * @brief Port F
  */
typedef struct
{
  __IO uint32_t DATA;
       uint32_t RESERVED0[10];
  __IO uint32_t PUP;
       uint32_t RESERVED1[2];
  __IO uint32_t IE;
} TSB_PF_TypeDef;

/**
  * @brief Port G
  */
typedef struct
{
  __IO uint32_t DATA;
       uint32_t RESERVED0[10];
  __IO uint32_t PUP;
       uint32_t RESERVED1[2];
  __IO uint32_t IE;
} TSB_PG_TypeDef;

/**
  * @brief Port H
  */
typedef struct
{
  __IO uint32_t DATA;
  __IO uint32_t CR;
  __IO uint32_t FR1;
       uint32_t RESERVED0[8];
  __IO uint32_t FPUP;
  __IO uint32_t PDN;
       uint32_t RESERVED1;
  __IO uint32_t IE;
} TSB_PH_TypeDef;

/**
  * @brief Port J
  */
typedef struct
{
  __IO uint32_t DATA;        
       uint32_t RESERVED0[10];
  __IO uint32_t PUP;
       uint32_t RESERVED1[2];
  __IO uint32_t IE;
} TSB_PJ_TypeDef;

/**
  * @brief Port K
  */
typedef struct
{
  __IO uint32_t DATA;
  __IO uint32_t CR;
  __IO uint32_t FR1;
  __IO uint32_t FR2;
  __IO uint32_t FR3;
       uint32_t RESERVED0[6];
  __IO uint32_t PUP;
       uint32_t RESERVED1[2];
  __IO uint32_t IE;
} TSB_PK_TypeDef;

/**
  * @brief Port L
  */
typedef struct
{
  __IO uint32_t DATA;
  __IO uint32_t CR;
  __IO uint32_t FR1;
} TSB_PL_TypeDef;

/**
  * @brief Port M
  */
typedef struct
{
  __IO uint32_t DATA;
       uint32_t RESERVED0;
  __I  uint32_t FR1;
       uint32_t RESERVED1[8];
  __IO uint32_t PUP;
       uint32_t RESERVED2[2];
  __IO uint32_t IE;
} TSB_PM_TypeDef;

/**
  * @brief Timer B
  */
typedef struct
{
  __IO uint32_t EN;
  __IO uint32_t RUN;
  __IO uint32_t CR;
  __IO uint32_t MOD;
  __IO uint32_t FFCR;
  __I  uint32_t ST;
  __IO uint32_t IM;
  __I  uint32_t UC;
  __IO uint32_t RG0;
  __IO uint32_t RG1;
  __I  uint32_t CP0;
  __I  uint32_t CP1;
  __IO uint32_t DMA;
} TSB_TB_TypeDef;

/**
  * @brief Serial Bus Interfac
  */
typedef struct
{
  __IO uint32_t CR0;
  __IO uint32_t CR1;
  __IO uint32_t DBR;
  __IO uint32_t I2CAR;
union {
  __O  uint32_t CR2;
  __I  uint32_t SR;
  };
  __IO uint32_t BR0;
} TSB_SBI_TypeDef;

/**
  * @brief Serial Channel(SIO/UART)
  */
typedef struct
{
  __IO uint32_t EN;
  __IO uint32_t BUF;
  __IO uint32_t CR;
  __IO uint32_t MOD0;
  __IO uint32_t BRCR;
  __IO uint32_t BRADD;
  __IO uint32_t MOD1;
  __IO uint32_t MOD2;
  __IO uint32_t RFC;
  __IO uint32_t TFC;
  __I  uint32_t RST;
  __I  uint32_t TST;
  __IO uint32_t FCNF;
  __IO uint32_t DMA;
} TSB_SC_TypeDef;

/**
  * @brief Cereal reception response
  */
typedef struct
{
  __IO uint32_t EN;
  __IO uint32_t CR0;
  __IO uint32_t CR1;
} TSB_SIOR_TypeDef;

/**
  * @brief Watchdog Timer
  */
typedef struct
{
  __IO uint32_t MOD;
  __IO uint32_t CR;
} TSB_WD_TypeDef;

/**
  * @brief Clock/Mode control
  */
typedef struct
{
  __IO uint32_t CYSCR;
  __IO uint32_t OSCCR;
  __IO uint32_t STBYCR;
  __IO uint32_t PLLSEL;
  __IO uint32_t CKSEL;
  __IO uint32_t PWMGEAR;
       uint32_t RESERVED0[9];
  __IO uint32_t PROTECT;
  __IO uint32_t IMCGA;
  __IO uint32_t IMCGB;
  __IO uint32_t IMCGC;
       uint32_t RESERVED1[5];
  __IO uint32_t ICRCG;
  __IO uint32_t RSTFLG;
} TSB_CG_TypeDef;

/**
  * @brief Flash control
  */
typedef struct
{
       uint32_t RESERVED0[4];
  __IO uint32_t SECBIT;
       uint32_t RESERVED1[3];
  __I  uint32_t FLCS;
} TSB_FC_TypeDef;


/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)


#define TSB_DMACA_BASE             (PERI_BASE  + 0x0000000UL)
#define TSB_DMACB_BASE             (PERI_BASE  + 0x0001000UL)
#define TSB_PSC_BASE               (PERI_BASE  + 0x000C000UL)
#define TSB_SSP_BASE               (PERI_BASE  + 0x0040000UL)
#define TSB_UART_BASE              (PERI_BASE  + 0x0048000UL)
#define TSB_ADA_BASE               (PERI_BASE  + 0x0050000UL)
#define TSB_ADB_BASE               (PERI_BASE  + 0x0051000UL)
#define TSB_DA0_BASE               (PERI_BASE  + 0x0054000UL)
#define TSB_DA1_BASE               (PERI_BASE  + 0x0055000UL)
#define TSB_TDA_BASE               (PERI_BASE  + 0x0058000UL)
#define TSB_TDB_BASE               (PERI_BASE  + 0x0059000UL)
#define TSB_TD0A_BASE              (PERI_BASE  + 0x0058000UL)
#define TSB_TD0B_BASE              (PERI_BASE  + 0x0059000UL)
#define TSB_TD1A_BASE              (PERI_BASE  + 0x0058000UL)
#define TSB_TD1B_BASE              (PERI_BASE  + 0x0059000UL)
#define TSB_ENC0_BASE              (PERI_BASE  + 0x0060000UL)
#define TSB_ENC1_BASE              (PERI_BASE  + 0x0061000UL)
#define TSB_VSIO_BASE              (PERI_BASE  + 0x0062000UL)
#define TSB_DSAD_BASE              (PERI_BASE  + 0x0067000UL)
#define TSB_AD_MIRA_BASE           (PERI_BASE  + 0x0074000UL)
#define TSB_AD_MIRB_BASE           (PERI_BASE  + 0x0079000UL)
#define TSB_ENC_MIR0_BASE          (PERI_BASE  + 0x0075000UL)
#define TSB_ENC_MIR1_BASE          (PERI_BASE  + 0x0076000UL)
#define TSB_PA_BASE                (PERI_BASE  + 0x00C0000UL)
#define TSB_PB_BASE                (PERI_BASE  + 0x00C0100UL)
#define TSB_PC_BASE                (PERI_BASE  + 0x00C0200UL)
#define TSB_PD_BASE                (PERI_BASE  + 0x00C0300UL)
#define TSB_PE_BASE                (PERI_BASE  + 0x00C0400UL)
#define TSB_PF_BASE                (PERI_BASE  + 0x00C0500UL)
#define TSB_PG_BASE                (PERI_BASE  + 0x00C0600UL)
#define TSB_PH_BASE                (PERI_BASE  + 0x00C0700UL)
#define TSB_PJ_BASE                (PERI_BASE  + 0x00C0900UL)
#define TSB_PK_BASE                (PERI_BASE  + 0x00C0A00UL)
#define TSB_PL_BASE                (PERI_BASE  + 0x00C0B00UL)
#define TSB_PM_BASE                (PERI_BASE  + 0x00C0C00UL)
#define TSB_TB0_BASE               (PERI_BASE  + 0x00C4000UL)
#define TSB_TB1_BASE               (PERI_BASE  + 0x00C4100UL)
#define TSB_TB2_BASE               (PERI_BASE  + 0x00C4200UL)
#define TSB_TB3_BASE               (PERI_BASE  + 0x00C4300UL)
#define TSB_TB4_BASE               (PERI_BASE  + 0x00C4400UL)
#define TSB_TB5_BASE               (PERI_BASE  + 0x00C4500UL)
#define TSB_TB6_BASE               (PERI_BASE  + 0x00C4600UL)
#define TSB_TB7_BASE               (PERI_BASE  + 0x00C4700UL)
#define TSB_TB8_BASE               (PERI_BASE  + 0x00C4800UL)
#define TSB_TB9_BASE               (PERI_BASE  + 0x00C4900UL)
#define TSB_SBI_BASE               (PERI_BASE  + 0x00E0000UL)
#define TSB_SC0_BASE               (PERI_BASE  + 0x00E1000UL)
#define TSB_SC2_BASE               (PERI_BASE  + 0x00E1200UL)
#define TSB_SC1_BASE               (PERI_BASE  + 0x00E1100UL)
#define TSB_SC3_BASE               (PERI_BASE  + 0x00E1300UL)
#define TSB_SIOR_BASE              (PERI_BASE  + 0x00F1000UL)
#define TSB_WD_BASE                (PERI_BASE  + 0x00F2000UL)
#define TSB_CG_BASE                (PERI_BASE  + 0x00F3000UL)
#define TSB_FC_BASE                (PERI_BASE  + 0x1FFF000UL)


