MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM342FYXBG/mcu.h
/* Peripheral declaration */
#define TSB_DMACA                  ((   TSB_DMAC_TypeDef *) TSB_DMACA_BASE)
#define TSB_DMACB                  ((   TSB_DMAC_TypeDef *) TSB_DMACB_BASE)
#define TSB_PSC                    ((    TSB_PSC_TypeDef *)   TSB_PSC_BASE)
#define TSB_SSP                    ((    TSB_SSP_TypeDef *)   TSB_SSP_BASE)
#define TSB_UART                   ((   TSB_UART_TypeDef *)  TSB_UART_BASE)
#define TSB_ADA                    ((     TSB_AD_TypeDef *)   TSB_ADA_BASE)
#define TSB_ADB                    ((     TSB_AD_TypeDef *)   TSB_ADB_BASE)
#define TSB_DA0                    ((     TSB_DA_TypeDef *)   TSB_DA0_BASE)
#define TSB_DA1                    ((     TSB_DA_TypeDef *)   TSB_DA1_BASE)
#define TSB_TDA                    ((     TSB_TD_TypeDef *)   TSB_TDA_BASE)
#define TSB_TDB                    ((     TSB_TD_TypeDef *)   TSB_TDB_BASE)
#define TSB_TD0A                   ((    TSB_TD0_TypeDef *)  TSB_TD0A_BASE)
#define TSB_TD0B                   ((    TSB_TD0_TypeDef *)  TSB_TD0B_BASE)
#define TSB_TD1A                   ((    TSB_TD1_TypeDef *)  TSB_TD1A_BASE)
#define TSB_TD1B                   ((    TSB_TD1_TypeDef *)  TSB_TD1B_BASE)
#define TSB_ENC0                   ((    TSB_ENC_TypeDef *)  TSB_ENC0_BASE)
#define TSB_ENC1                   ((    TSB_ENC_TypeDef *)  TSB_ENC1_BASE)
#define TSB_VSIO                   ((   TSB_VSIO_TypeDef *)  TSB_VSIO_BASE)
#define TSB_DSAD                   ((   TSB_DSAD_TypeDef *)  TSB_DSAD_BASE)
#define TSB_AD_MIRA                (( TSB_AD_MIR_TypeDef *)TSB_AD_MIRA_BASE)
#define TSB_AD_MIRB                (( TSB_AD_MIR_TypeDef *)TSB_AD_MIRB_BASE)
#define TSB_ENC_MIR0               ((TSB_ENC_MIR_TypeDef *)TSB_ENC_MIR0_BASE)
#define TSB_ENC_MIR1               ((TSB_ENC_MIR_TypeDef *)TSB_ENC_MIR1_BASE)
#define TSB_PA                     ((     TSB_PA_TypeDef *)    TSB_PA_BASE)
#define TSB_PB                     ((     TSB_PB_TypeDef *)    TSB_PB_BASE)
#define TSB_PC                     ((     TSB_PC_TypeDef *)    TSB_PC_BASE)
#define TSB_PD                     ((     TSB_PD_TypeDef *)    TSB_PD_BASE)
#define TSB_PE                     ((     TSB_PE_TypeDef *)    TSB_PE_BASE)
#define TSB_PF                     ((     TSB_PF_TypeDef *)    TSB_PF_BASE)
#define TSB_PG                     ((     TSB_PG_TypeDef *)    TSB_PG_BASE)
#define TSB_PH                     ((     TSB_PH_TypeDef *)    TSB_PH_BASE)
#define TSB_PJ                     ((     TSB_PJ_TypeDef *)    TSB_PJ_BASE)
#define TSB_PK                     ((     TSB_PK_TypeDef *)    TSB_PK_BASE)
#define TSB_PL                     ((     TSB_PL_TypeDef *)    TSB_PL_BASE)
#define TSB_PM                     ((     TSB_PM_TypeDef *)    TSB_PM_BASE)
#define TSB_TB0                    ((     TSB_TB_TypeDef *)   TSB_TB0_BASE)
#define TSB_TB1                    ((     TSB_TB_TypeDef *)   TSB_TB1_BASE)
#define TSB_TB2                    ((     TSB_TB_TypeDef *)   TSB_TB2_BASE)
#define TSB_TB3                    ((     TSB_TB_TypeDef *)   TSB_TB3_BASE)
#define TSB_TB4                    ((     TSB_TB_TypeDef *)   TSB_TB4_BASE)
#define TSB_TB5                    ((     TSB_TB_TypeDef *)   TSB_TB5_BASE)
#define TSB_TB6                    ((     TSB_TB_TypeDef *)   TSB_TB6_BASE)
#define TSB_TB7                    ((     TSB_TB_TypeDef *)   TSB_TB7_BASE)
#define TSB_TB8                    ((     TSB_TB_TypeDef *)   TSB_TB8_BASE)
#define TSB_TB9                    ((     TSB_TB_TypeDef *)   TSB_TB9_BASE)
#define TSB_SBI                    ((    TSB_SBI_TypeDef *)   TSB_SBI_BASE)
#define TSB_SC0                    ((     TSB_SC_TypeDef *)   TSB_SC0_BASE)
#define TSB_SC2                    ((     TSB_SC_TypeDef *)   TSB_SC2_BASE)
#define TSB_SC1                    ((     TSB_SC_TypeDef *)   TSB_SC1_BASE)
#define TSB_SC3                    ((     TSB_SC_TypeDef *)   TSB_SC3_BASE)
#define TSB_SIOR                   ((   TSB_SIOR_TypeDef *)  TSB_SIOR_BASE)
#define TSB_WD                     ((     TSB_WD_TypeDef *)    TSB_WD_BASE)
#define TSB_CG                     ((     TSB_CG_TypeDef *)    TSB_CG_BASE)
#define TSB_FC                     ((     TSB_FC_TypeDef *)    TSB_FC_BASE)


/* Bit-Band for Device Specific Peripheral Registers */
#define BITBAND_OFFSET (0x02000000UL)
#define BITBAND_PERI_BASE (PERI_BASE + BITBAND_OFFSET)
#define BITBAND_PERI(addr, bitnum) (BITBAND_PERI_BASE + (((uint32_t)(addr) - PERI_BASE) << 5) + ((uint32_t)(bitnum) << 2))



/* DMA Controller */
#define TSB_DMACA_INTSTATUS_INTSTATUS0            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTSTATUS,0)))
#define TSB_DMACA_INTSTATUS_INTSTATUS1            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTSTATUS,1)))
#define TSB_DMACA_INTTCSTATUS_INTTCSTATUS0        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTTCSTATUS,0)))
#define TSB_DMACA_INTTCSTATUS_INTTCSTATUS1        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTTCSTATUS,1)))
#define TSB_DMACA_INTTCCLEAR_INTTCCLEAR0          (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTTCCLEAR,0)))
#define TSB_DMACA_INTTCCLEAR_INTTCCLEAR1          (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTTCCLEAR,1)))
#define TSB_DMACA_INTERRORSTATUS_INTERRSTATUS0    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTERRORSTATUS,0)))
#define TSB_DMACA_INTERRORSTATUS_INTERRSTATUS1    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTERRORSTATUS,1)))
#define TSB_DMACA_INTERRCLR_INTERRCLR0            (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTERRCLR,0)))
#define TSB_DMACA_INTERRCLR_INTERRCLR1            (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTERRCLR,1)))
#define TSB_DMACA_RAWINTTCSTATUS_RAWINTTCS0       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->RAWINTTCSTATUS,0)))
#define TSB_DMACA_RAWINTTCSTATUS_RAWINTTCS1       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->RAWINTTCSTATUS,1)))
#define TSB_DMACA_RAWINTERRORSTATUS_RAWINTERRS0   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->RAWINTERRORSTATUS,0)))
#define TSB_DMACA_RAWINTERRORSTATUS_RAWINTERRS1   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->RAWINTERRORSTATUS,1)))
#define TSB_DMACA_ENBLDCHNS_ENABLEDCH0            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->ENBLDCHNS,0)))
#define TSB_DMACA_ENBLDCHNS_ENABLEDCH1            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->ENBLDCHNS,1)))
#define TSB_DMACA_SOFTSREQ_SOFTSREQ0              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->SOFTSREQ,0)))
#define TSB_DMACA_SOFTSREQ_SOFTSREQ1              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->SOFTSREQ,1)))
#define TSB_DMACA_SOFTSREQ_SOFTSREQ14             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->SOFTSREQ,14)))
#define TSB_DMACA_SOFTSREQ_SOFTSREQ15             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->SOFTSREQ,15)))
#define TSB_DMACA_CONFIGURATION_E                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->CONFIGURATION,0)))
#define TSB_DMACA_CONFIGURATION_M                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->CONFIGURATION,1)))
#define TSB_DMACA_C0CNTROL_SI                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CNTROL,26)))
#define TSB_DMACA_C0CNTROL_DI                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CNTROL,27)))
#define TSB_DMACA_C0CNTROL_I                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CNTROL,31)))
#define TSB_DMACA_C0CONFIGURATION_E               (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,0)))
#define TSB_DMACA_C0CONFIGURATION_IE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,14)))
#define TSB_DMACA_C0CONFIGURATION_ITC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,15)))
#define TSB_DMACA_C0CONFIGURATION_LOCK            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,16)))
#define TSB_DMACA_C0CONFIGURATION_ACTIVE          (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,17)))
#define TSB_DMACA_C0CONFIGURATION_HALT            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,18)))
#define TSB_DMACA_C1CONTROL_SI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONTROL,26)))
#define TSB_DMACA_C1CONTROL_DI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONTROL,27)))
#define TSB_DMACA_C1CONTROL_I                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONTROL,31)))
#define TSB_DMACA_C1CONFIGURATION_E               (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,0)))
#define TSB_DMACA_C1CONFIGURATION_IE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,14)))
#define TSB_DMACA_C1CONFIGURATION_ITC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,15)))
#define TSB_DMACA_C1CONFIGURATION_LOCK            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,16)))
#define TSB_DMACA_C1CONFIGURATION_ACTIVE          (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,17)))
#define TSB_DMACA_C1CONFIGURATION_HALT            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,18)))

#define TSB_DMACB_INTSTATUS_INTSTATUS0            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTSTATUS,0)))
#define TSB_DMACB_INTSTATUS_INTSTATUS1            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTSTATUS,1)))
#define TSB_DMACB_INTTCSTATUS_INTTCSTATUS0        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTTCSTATUS,0)))
#define TSB_DMACB_INTTCSTATUS_INTTCSTATUS1        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTTCSTATUS,1)))
#define TSB_DMACB_INTTCCLEAR_INTTCCLEAR0          (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTTCCLEAR,0)))
#define TSB_DMACB_INTTCCLEAR_INTTCCLEAR1          (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTTCCLEAR,1)))
#define TSB_DMACB_INTERRORSTATUS_INTERRSTATUS0    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTERRORSTATUS,0)))
#define TSB_DMACB_INTERRORSTATUS_INTERRSTATUS1    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTERRORSTATUS,1)))
#define TSB_DMACB_INTERRCLR_INTERRCLR0            (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTERRCLR,0)))
#define TSB_DMACB_INTERRCLR_INTERRCLR1            (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTERRCLR,1)))
#define TSB_DMACB_RAWINTTCSTATUS_RAWINTTCS0       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->RAWINTTCSTATUS,0)))
#define TSB_DMACB_RAWINTTCSTATUS_RAWINTTCS1       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->RAWINTTCSTATUS,1)))
#define TSB_DMACB_RAWINTERRORSTATUS_RAWINTERRS0   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->RAWINTERRORSTATUS,0)))
#define TSB_DMACB_RAWINTERRORSTATUS_RAWINTERRS1   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->RAWINTERRORSTATUS,1)))
#define TSB_DMACB_ENBLDCHNS_ENABLEDCH0            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->ENBLDCHNS,0)))
#define TSB_DMACB_ENBLDCHNS_ENABLEDCH1            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->ENBLDCHNS,1)))
#define TSB_DMACB_SOFTSREQ_SOFTSREQ0              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->SOFTSREQ,0)))
#define TSB_DMACB_SOFTSREQ_SOFTSREQ1              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->SOFTSREQ,1)))
#define TSB_DMACB_SOFTSREQ_SOFTSREQ14             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->SOFTSREQ,14)))
#define TSB_DMACB_SOFTSREQ_SOFTSREQ15             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->SOFTSREQ,15)))
#define TSB_DMACB_CONFIGURATION_E                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->CONFIGURATION,0)))
#define TSB_DMACB_CONFIGURATION_M                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->CONFIGURATION,1)))
#define TSB_DMACB_C0CNTROL_SI                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CNTROL,26)))
#define TSB_DMACB_C0CNTROL_DI                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CNTROL,27)))
#define TSB_DMACB_C0CNTROL_I                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CNTROL,31)))
#define TSB_DMACB_C0CONFIGURATION_E               (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,0)))
#define TSB_DMACB_C0CONFIGURATION_IE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,14)))
#define TSB_DMACB_C0CONFIGURATION_ITC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,15)))
#define TSB_DMACB_C0CONFIGURATION_LOCK            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,16)))
#define TSB_DMACB_C0CONFIGURATION_ACTIVE          (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,17)))
#define TSB_DMACB_C0CONFIGURATION_HALT            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,18)))
#define TSB_DMACB_C1CONTROL_SI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONTROL,26)))
#define TSB_DMACB_C1CONTROL_DI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONTROL,27)))
#define TSB_DMACB_C1CONTROL_I                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONTROL,31)))
#define TSB_DMACB_C1CONFIGURATION_E               (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,0)))
#define TSB_DMACB_C1CONFIGURATION_IE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,14)))
#define TSB_DMACB_C1CONFIGURATION_ITC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,15)))
#define TSB_DMACB_C1CONFIGURATION_LOCK            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,16)))
#define TSB_DMACB_C1CONFIGURATION_ACTIVE          (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,17)))
#define TSB_DMACB_C1CONFIGURATION_HALT            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,18)))


/* Programmable Servo Controller  */
#define TSB_PSC_SGN_SA0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->SGN,16)))
#define TSB_PSC_SGN_SM0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->SGN,17)))
#define TSB_PSC_SGN_SM1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->SGN,18)))
#define TSB_PSC_SGN_SL0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->SGN,19)))
#define TSB_PSC_SGN_SL1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->SGN,20)))
#define TSB_PSC_SGN_SR0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->SGN,21)))
#define TSB_PSC_SGN_SR1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->SGN,22)))
#define TSB_PSC_PSCCNT_START                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->PSCCNT,16)))
#define TSB_PSC_PSCCNT_TENB                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->PSCCNT,17)))
#define TSB_PSC_PSCCNT_STEP                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->PSCCNT,24)))
#define TSB_PSC_PSCCNT_BRK                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->PSCCNT,25)))
#define TSB_PSC_PSCFLG_OVER                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->PSCFLG,16)))
#define TSB_PSC_PSCFLG_UNDER                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->PSCFLG,17)))
#define TSB_PSC_PSCFLG_ZERO                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSC->PSCFLG,24)))


/* Syncronous Serial Port */
#define TSB_SSP_CR0_SPO                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->CR0,6)))
#define TSB_SSP_CR0_SPH                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->CR0,7)))
#define TSB_SSP_CR1_SSE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->CR1,1)))
#define TSB_SSP_CR1_MS                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->CR1,2)))
#define TSB_SSP_CR1_SOD                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->CR1,3)))
#define TSB_SSP_SR_TFE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->SR,0)))
#define TSB_SSP_SR_TNF                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->SR,1)))
#define TSB_SSP_SR_RNE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->SR,2)))
#define TSB_SSP_SR_RFF                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->SR,3)))
#define TSB_SSP_SR_BSY                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->SR,4)))
#define TSB_SSP_IMSC_RORIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->IMSC,0)))
#define TSB_SSP_IMSC_RTIM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->IMSC,1)))
#define TSB_SSP_IMSC_RXIM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->IMSC,2)))
#define TSB_SSP_IMSC_TXIM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->IMSC,3)))
#define TSB_SSP_RIS_RORRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->RIS,0)))
#define TSB_SSP_RIS_RTRIS                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->RIS,1)))
#define TSB_SSP_RIS_RXRIS                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->RIS,2)))
#define TSB_SSP_RIS_TXRIS                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->RIS,3)))
#define TSB_SSP_MIS_RORMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->MIS,0)))
#define TSB_SSP_MIS_RTMIS                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->MIS,1)))
#define TSB_SSP_MIS_RXMIS                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->MIS,2)))
#define TSB_SSP_MIS_TXMIS                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP->MIS,3)))
#define TSB_SSP_ICR_RORIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_SSP->ICR,0)))
#define TSB_SSP_ICR_RTIC                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_SSP->ICR,1)))
#define TSB_SSP_DMACR_RXDMAE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->DMACR,0)))
#define TSB_SSP_DMACR_TXDMAE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP->DMACR,1)))


