MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM342FYXBG/mcu.h
/* UART(PL011) */
#define TSB_UART_DR_FE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->DR,8)))
#define TSB_UART_DR_PE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->DR,9)))
#define TSB_UART_DR_BE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->DR,10)))
#define TSB_UART_DR_OE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->DR,11)))
#define TSB_UART_SR_FE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->SR,0)))
#define TSB_UART_SR_PE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->SR,1)))
#define TSB_UART_SR_BE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->SR,2)))
#define TSB_UART_SR_OE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->SR,3)))
#define TSB_UART_ECR_FE                           (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ECR,0)))
#define TSB_UART_ECR_PE                           (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ECR,1)))
#define TSB_UART_ECR_BE                           (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ECR,2)))
#define TSB_UART_ECR_OE                           (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ECR,3)))
#define TSB_UART_FR_CTS                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,0)))
#define TSB_UART_FR_BUSY                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,3)))
#define TSB_UART_FR_RXFE                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,4)))
#define TSB_UART_FR_TXFF                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,5)))
#define TSB_UART_FR_RXFF                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,6)))
#define TSB_UART_FR_TXFE                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,7)))
#define TSB_UART_LCR_H_BRK                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,0)))
#define TSB_UART_LCR_H_PEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,1)))
#define TSB_UART_LCR_H_EPS                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,2)))
#define TSB_UART_LCR_H_STP2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,3)))
#define TSB_UART_LCR_H_FEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,4)))
#define TSB_UART_LCR_H_SPS                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,7)))
#define TSB_UART_CR_UARTEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->CR,0)))
#define TSB_UART_CR_TXE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->CR,8)))
#define TSB_UART_CR_RXE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->CR,9)))
#define TSB_UART_CR_CTSEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->CR,15)))
#define TSB_UART_IMSC_CTSMIM                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,1)))
#define TSB_UART_IMSC_RXIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,4)))
#define TSB_UART_IMSC_TXIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,5)))
#define TSB_UART_IMSC_RTIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,6)))
#define TSB_UART_IMSC_FEIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,7)))
#define TSB_UART_IMSC_PEIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,8)))
#define TSB_UART_IMSC_BEIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,9)))
#define TSB_UART_IMSC_OEIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,10)))
#define TSB_UART_RIS_CTSRMIS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,1)))
#define TSB_UART_RIS_RXRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,4)))
#define TSB_UART_RIS_TXRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,5)))
#define TSB_UART_RIS_RTRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,6)))
#define TSB_UART_RIS_FERIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,7)))
#define TSB_UART_RIS_PERIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,8)))
#define TSB_UART_RIS_BERIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,9)))
#define TSB_UART_RIS_OERIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,10)))
#define TSB_UART_MIS_CTSMMIS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,1)))
#define TSB_UART_MIS_RXMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,4)))
#define TSB_UART_MIS_TXMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,5)))
#define TSB_UART_MIS_RTMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,6)))
#define TSB_UART_MIS_FEMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,7)))
#define TSB_UART_MIS_PEMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,8)))
#define TSB_UART_MIS_BEMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,9)))
#define TSB_UART_MIS_OEMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,10)))
#define TSB_UART_ICR_CTSMIC                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,1)))
#define TSB_UART_ICR_RXIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,4)))
#define TSB_UART_ICR_TXIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,5)))
#define TSB_UART_ICR_RTIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,6)))
#define TSB_UART_ICR_FEIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,7)))
#define TSB_UART_ICR_REIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,8)))
#define TSB_UART_ICR_BEIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,9)))
#define TSB_UART_ICR_OEIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,10)))
#define TSB_UART_DMACR_RXDMAE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->DMACR,0)))
#define TSB_UART_DMACR_TXDMAE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->DMACR,1)))
#define TSB_UART_DMACR_DMAONERR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->DMACR,2)))


/* 12-bit AD converter */
#define TSB_ADA_MOD0_ADS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD0,0)))
#define TSB_ADA_MOD0_HPADS                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD0,1)))
#define TSB_ADA_MOD1_ADHWE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,0)))
#define TSB_ADA_MOD1_ADHWS                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,1)))
#define TSB_ADA_MOD1_HPADHWE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,2)))
#define TSB_ADA_MOD1_HPADHWS                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,3)))
#define TSB_ADA_MOD1_RCUT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,5)))
#define TSB_ADA_MOD1_I2AD                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,6)))
#define TSB_ADA_MOD1_VREFON                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,7)))
#define TSB_ADA_MOD3_SCAN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD3,0)))
#define TSB_ADA_MOD3_REPEAT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD3,1)))
#define TSB_ADA_MOD5_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,0)))
#define TSB_ADA_MOD5_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,1)))
#define TSB_ADA_MOD5_HPADBF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,2)))
#define TSB_ADA_MOD5_HPEOCF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,3)))
#define TSB_ADA_MOD7_INTADDMA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD7,0)))
#define TSB_ADA_MOD7_INTADHPDMA                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD7,1)))
#define TSB_ADA_CMPCR0_ADBIG0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR0,4)))
#define TSB_ADA_CMPCR0_CMPCOND0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR0,5)))
#define TSB_ADA_CMPCR0_CMP0EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR0,7)))
#define TSB_ADA_CMPCR1_ADBIG1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR1,4)))
#define TSB_ADA_CMPCR1_CMPCOND1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR1,5)))
#define TSB_ADA_CMPCR1_CMP1EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR1,7)))
#define TSB_ADA_REG0_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG0,12)))
#define TSB_ADA_REG0_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG0,13)))
#define TSB_ADA_REG0_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG0,14)))
#define TSB_ADA_REG1_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG1,12)))
#define TSB_ADA_REG1_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG1,13)))
#define TSB_ADA_REG1_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG1,14)))
#define TSB_ADA_REG2_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG2,12)))
#define TSB_ADA_REG2_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG2,13)))
#define TSB_ADA_REG2_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG2,14)))
#define TSB_ADA_REG3_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG3,12)))
#define TSB_ADA_REG3_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG3,13)))
#define TSB_ADA_REG3_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG3,14)))
#define TSB_ADA_REG4_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG4,12)))
#define TSB_ADA_REG4_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG4,13)))
#define TSB_ADA_REG4_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG4,14)))
#define TSB_ADA_REG5_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG5,12)))
#define TSB_ADA_REG5_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG5,13)))
#define TSB_ADA_REG5_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG5,14)))
#define TSB_ADA_REG6_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG6,12)))
#define TSB_ADA_REG6_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG6,13)))
#define TSB_ADA_REG6_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG6,14)))
#define TSB_ADA_REG7_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG7,12)))
#define TSB_ADA_REG7_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG7,13)))
#define TSB_ADA_REG7_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG7,14)))
#define TSB_ADA_REGSP_ADRFSP                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REGSP,12)))
#define TSB_ADA_REGSP_ADOVFSP                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REGSP,13)))

#define TSB_ADB_MOD0_ADS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD0,0)))
#define TSB_ADB_MOD0_HPADS                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD0,1)))
#define TSB_ADB_MOD1_ADHWE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,0)))
#define TSB_ADB_MOD1_ADHWS                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,1)))
#define TSB_ADB_MOD1_HPADHWE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,2)))
#define TSB_ADB_MOD1_HPADHWS                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,3)))
#define TSB_ADB_MOD1_RCUT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,5)))
#define TSB_ADB_MOD1_I2AD                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,6)))
#define TSB_ADB_MOD1_VREFON                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,7)))
#define TSB_ADB_MOD3_SCAN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD3,0)))
#define TSB_ADB_MOD3_REPEAT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD3,1)))
#define TSB_ADB_MOD5_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,0)))
#define TSB_ADB_MOD5_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,1)))
#define TSB_ADB_MOD5_HPADBF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,2)))
#define TSB_ADB_MOD5_HPEOCF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,3)))
#define TSB_ADB_MOD7_INTADDMA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD7,0)))
#define TSB_ADB_MOD7_INTADHPDMA                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD7,1)))
#define TSB_ADB_CMPCR0_ADBIG0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR0,4)))
#define TSB_ADB_CMPCR0_CMPCOND0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR0,5)))
#define TSB_ADB_CMPCR0_CMP0EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR0,7)))
#define TSB_ADB_CMPCR1_ADBIG1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR1,4)))
#define TSB_ADB_CMPCR1_CMPCOND1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR1,5)))
#define TSB_ADB_CMPCR1_CMP1EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR1,7)))
#define TSB_ADB_REG0_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG0,12)))
#define TSB_ADB_REG0_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG0,13)))
#define TSB_ADB_REG0_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG0,14)))
#define TSB_ADB_REG1_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG1,12)))
#define TSB_ADB_REG1_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG1,13)))
#define TSB_ADB_REG1_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG1,14)))
#define TSB_ADB_REG2_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG2,12)))
#define TSB_ADB_REG2_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG2,13)))
#define TSB_ADB_REG2_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG2,14)))
#define TSB_ADB_REG3_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG3,12)))
#define TSB_ADB_REG3_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG3,13)))
#define TSB_ADB_REG3_ADPOSWF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG3,14)))
#define TSB_ADB_REGSP_ADRFSP                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REGSP,12)))
#define TSB_ADB_REGSP_ADOVFSP                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REGSP,13)))


/* 10-bit DA converter */
#define TSB_DA0_CTL_OP                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DA0->CTL,0)))
#define TSB_DA0_CTL_VREFON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DA0->CTL,1)))

#define TSB_DA1_CTL_OP                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DA1->CTL,0)))
#define TSB_DA1_CTL_VREFON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DA1->CTL,1)))


/* Timer D-common */
#define TSB_TDA_BCR_TDSFT00                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDA->BCR,0)))
#define TSB_TDA_BCR_TDSFT01                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDA->BCR,1)))
#define TSB_TDA_BCR_TDSFT10                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDA->BCR,2)))
#define TSB_TDA_BCR_TDSFT11                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDA->BCR,3)))
#define TSB_TDA_BCR_PHSCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->BCR,4)))
#define TSB_TDA_EN_TDHALT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->EN,5)))
#define TSB_TDA_EN_TDEN0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->EN,6)))
#define TSB_TDA_EN_TDEN1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->EN,7)))
#define TSB_TDA_CONF_TDI2TD0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->CONF,6)))
#define TSB_TDA_CONF_TDI2TD1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->CONF,7)))

#define TSB_TDB_BCR_TDSFT00                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDB->BCR,0)))
#define TSB_TDB_BCR_TDSFT01                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDB->BCR,1)))
#define TSB_TDB_BCR_TDSFT10                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDB->BCR,2)))
#define TSB_TDB_BCR_TDSFT11                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDB->BCR,3)))
#define TSB_TDB_BCR_PHSCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->BCR,4)))
#define TSB_TDB_EN_TDHALT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->EN,5)))
#define TSB_TDB_EN_TDEN0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->EN,6)))
#define TSB_TDB_EN_TDEN1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->EN,7)))
#define TSB_TDB_CONF_TDI2TD0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->CONF,6)))
#define TSB_TDB_CONF_TDI2TD1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->CONF,7)))


/* Timer D-unit0 */
#define TSB_TD0A_RUN_TDRUN                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_TD0A->RUN,0)))
#define TSB_TD0A_CR_TDRDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0A->CR,2)))
#define TSB_TD0A_CR_TDMDPT00                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0A->CR,4)))
#define TSB_TD0A_CR_TDMDPT01                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0A->CR,8)))
#define TSB_TD0A_MOD_TDCLE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0A->MOD,4)))
#define TSB_TD0A_MOD_TDIV0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0A->MOD,6)))
#define TSB_TD0A_MOD_TDIV1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0A->MOD,7)))
#define TSB_TD0A_DMA_DMAEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0A->DMA,0)))

#define TSB_TD0B_RUN_TDRUN                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_TD0B->RUN,0)))
#define TSB_TD0B_CR_TDRDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0B->CR,2)))
#define TSB_TD0B_CR_TDMDPT00                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0B->CR,4)))
#define TSB_TD0B_CR_TDMDPT01                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0B->CR,8)))
#define TSB_TD0B_MOD_TDCLE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0B->MOD,4)))
#define TSB_TD0B_MOD_TDIV0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0B->MOD,6)))
#define TSB_TD0B_MOD_TDIV1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0B->MOD,7)))
#define TSB_TD0B_DMA_DMAEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0B->DMA,0)))


/* Timer D-unit1 */
#define TSB_TD1A_RUN_TDRUN                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_TD1A->RUN,0)))
#define TSB_TD1A_CR_TDRDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1A->CR,2)))
#define TSB_TD1A_CR_TDMDPT10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1A->CR,4)))
#define TSB_TD1A_CR_TDMDPT11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1A->CR,8)))
#define TSB_TD1A_MOD_TDCLE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1A->MOD,4)))
#define TSB_TD1A_MOD_TDIV0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1A->MOD,6)))
#define TSB_TD1A_MOD_TDIV1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1A->MOD,7)))
#define TSB_TD1A_DMA_DMAEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1A->DMA,0)))

