MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM342FYXBG/mcu.h
#define TSB_TD1B_RUN_TDRUN                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_TD1B->RUN,0)))
#define TSB_TD1B_CR_TDRDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1B->CR,2)))
#define TSB_TD1B_CR_TDMDPT10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1B->CR,4)))
#define TSB_TD1B_CR_TDMDPT11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1B->CR,8)))
#define TSB_TD1B_MOD_TDCLE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1B->MOD,4)))
#define TSB_TD1B_MOD_TDIV0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1B->MOD,6)))
#define TSB_TD1B_MOD_TDIV1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1B->MOD,7)))
#define TSB_TD1B_DMA_DMAEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1B->DMA,0)))


/* Two aspect pulse input counter */
#define TSB_ENC0_EN_ENCEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->EN,0)))
#define TSB_ENC0_CNT_PBDIR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->CNT,11)))
#define TSB_ENC0_CNT_MA12                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->CNT,12)))
#define TSB_ENC0_CNT_MA2DIR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->CNT,13)))
#define TSB_ENC0_IE_INTENCCP0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->IE,0)))
#define TSB_ENC0_IE_INTENCCP1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->IE,1)))
#define TSB_ENC0_IE_INTENCOVF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->IE,2)))
#define TSB_ENC0_IE_INTENCUDF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->IE,3)))
#define TSB_ENC0_IE_INTB0DT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->IE,4)))
#define TSB_ENC0_IE_INTB1DT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->IE,5)))
#define TSB_ENC0_IE_INTB2DT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->IE,6)))
#define TSB_ENC0_IE_INTB3DT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->IE,7)))
#define TSB_ENC0_IE_INTDIR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->IE,8)))
#define TSB_ENC0_IE_INTOVF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->IE,9)))
#define TSB_ENC0_FLG_CMP0F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->FLG,0)))
#define TSB_ENC0_FLG_CMP1F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->FLG,1)))
#define TSB_ENC0_FLG_OVF                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->FLG,2)))
#define TSB_ENC0_FLG_UDF                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->FLG,3)))
#define TSB_ENC0_FLG_SB0F                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->FLG,4)))
#define TSB_ENC0_FLG_SB1F                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->FLG,5)))
#define TSB_ENC0_FLG_SB2F                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->FLG,6)))
#define TSB_ENC0_FLG_SB3F                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->FLG,7)))
#define TSB_ENC0_FLG_DIRF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->FLG,8)))
#define TSB_ENC0_ARUN_ENCRUN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->ARUN,0)))
#define TSB_ENC0_ARUN_ENCCLR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->ARUN,1)))
#define TSB_ENC0_BRUN_T24RUN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC0->BRUN,0)))
#define TSB_ENC0_BCAP00_OVF00                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC0->BCAP00,24)))
#define TSB_ENC0_BCAP10_OVF10                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC0->BCAP10,24)))
#define TSB_ENC0_BCAP20_OVF20                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC0->BCAP20,24)))
#define TSB_ENC0_BCAP30_OVF30                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC0->BCAP30,24)))

#define TSB_ENC1_EN_ENCEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->EN,0)))
#define TSB_ENC1_CNT_PBDIR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->CNT,11)))
#define TSB_ENC1_CNT_MA12                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->CNT,12)))
#define TSB_ENC1_CNT_MA2DIR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->CNT,13)))
#define TSB_ENC1_IE_INTENCCP0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->IE,0)))
#define TSB_ENC1_IE_INTENCCP1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->IE,1)))
#define TSB_ENC1_IE_INTENCOVF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->IE,2)))
#define TSB_ENC1_IE_INTENCUDF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->IE,3)))
#define TSB_ENC1_IE_INTB0DT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->IE,4)))
#define TSB_ENC1_IE_INTB1DT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->IE,5)))
#define TSB_ENC1_IE_INTB2DT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->IE,6)))
#define TSB_ENC1_IE_INTB3DT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->IE,7)))
#define TSB_ENC1_IE_INTDIR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->IE,8)))
#define TSB_ENC1_IE_INTOVF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->IE,9)))
#define TSB_ENC1_FLG_CMP0F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->FLG,0)))
#define TSB_ENC1_FLG_CMP1F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->FLG,1)))
#define TSB_ENC1_FLG_OVF                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->FLG,2)))
#define TSB_ENC1_FLG_UDF                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->FLG,3)))
#define TSB_ENC1_FLG_SB0F                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->FLG,4)))
#define TSB_ENC1_FLG_SB1F                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->FLG,5)))
#define TSB_ENC1_FLG_SB2F                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->FLG,6)))
#define TSB_ENC1_FLG_SB3F                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->FLG,7)))
#define TSB_ENC1_FLG_DIRF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->FLG,8)))
#define TSB_ENC1_ARUN_ENCRUN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->ARUN,0)))
#define TSB_ENC1_ARUN_ENCCLR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->ARUN,1)))
#define TSB_ENC1_BRUN_T24RUN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ENC1->BRUN,0)))
#define TSB_ENC1_BCAP00_OVF00                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC1->BCAP00,24)))
#define TSB_ENC1_BCAP10_OVF10                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC1->BCAP10,24)))
#define TSB_ENC1_BCAP20_OVF20                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC1->BCAP20,24)))
#define TSB_ENC1_BCAP30_OVF30                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC1->BCAP30,24)))


/* Changeable data length cereal(SIO) */
#define TSB_VSIO_EN_SIOE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->EN,0)))
#define TSB_VSIO_CR0_DL1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR0,1)))
#define TSB_VSIO_CR0_DRCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR0,6)))
#define TSB_VSIO_CR0_CKPH                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR0,7)))
#define TSB_VSIO_CR0_CS0PH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR0,8)))
#define TSB_VSIO_CR0_CS1PH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR0,9)))
#define TSB_VSIO_CR1_CSS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR1,4)))
#define TSB_VSIO_CR1_TRXE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR1,7)))
#define TSB_VSIO_CR3_INTTXWE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,0)))
#define TSB_VSIO_CR3_INTTXFE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,1)))
#define TSB_VSIO_CR3_INTRXWE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,2)))
#define TSB_VSIO_CR3_INTRXFE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,3)))
#define TSB_VSIO_CR3_INTRXEE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,4)))
#define TSB_VSIO_CR3_DMATE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,6)))
#define TSB_VSIO_CR3_DMARE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,7)))
#define TSB_VSIO_CR3_TWEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,8)))
#define TSB_VSIO_CR3_RWEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,9)))
#define TSB_VSIO_CR3_RXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,11)))
#define TSB_VSIO_CR3_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,12)))
#define TSB_VSIO_CR3_ORER                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,13)))
#define TSB_VSIO_CR3_RBFLL                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,14)))
#define TSB_VSIO_CR3_TBEMP                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_VSIO->CR3,15)))
#define TSB_VSIO_RFC_RFCS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_VSIO->RFC,7)))
#define TSB_VSIO_TFC_TFCS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_VSIO->TFC,7)))


/* 16-bit Deita sigma AD converter */
#define TSB_DSAD_DSMOD0_ADS                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD0,0)))
#define TSB_DSAD_DSMOD0_HPADS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD0,1)))
#define TSB_DSAD_DSMOD1_ADHWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD1,0)))
#define TSB_DSAD_DSMOD1_ADHWS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD1,1)))
#define TSB_DSAD_DSMOD1_HPADHWE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD1,2)))
#define TSB_DSAD_DSMOD1_HPADHWS                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD1,3)))
#define TSB_DSAD_DSMOD1_LP_EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD1,4)))
#define TSB_DSAD_DSMOD1_MOD_EN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD1,5)))
#define TSB_DSAD_DSMOD1_I2AD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD1,6)))
#define TSB_DSAD_DSMOD1_BIAS_EN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD1,7)))
#define TSB_DSAD_DSMOD3_SCAN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD3,0)))
#define TSB_DSAD_DSMOD3_REPEAT                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD3,1)))
#define TSB_DSAD_DSMOD5_ADBF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD5,0)))
#define TSB_DSAD_DSMOD5_EOCF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD5,1)))
#define TSB_DSAD_DSMOD5_HPADBF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD5,2)))
#define TSB_DSAD_DSMOD5_HPEOCF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD5,3)))
#define TSB_DSAD_DSMOD7_INTADDMA                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD7,0)))
#define TSB_DSAD_DSMOD7_INTDAHPDMA                (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSMOD7,1)))
#define TSB_DSAD_DSREG0_ADR0F                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG0,16)))
#define TSB_DSAD_DSREG0_AD0VR0F                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG0,17)))
#define TSB_DSAD_DSREG1_ADR1F                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG1,16)))
#define TSB_DSAD_DSREG1_AD0VR1F                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG1,17)))
#define TSB_DSAD_DSREG2_ADR2F                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG2,16)))
#define TSB_DSAD_DSREG2_AD0VR2F                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG2,17)))
#define TSB_DSAD_DSREG3_ADR3F                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG3,16)))
#define TSB_DSAD_DSREG3_AD0VR3F                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG3,17)))
#define TSB_DSAD_DSREG4_ADR4F                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG4,16)))
#define TSB_DSAD_DSREG4_AD0VR4F                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG4,17)))
#define TSB_DSAD_DSREG5_ADR5F                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG5,16)))
#define TSB_DSAD_DSREG5_AD0VR5F                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREG5,17)))
#define TSB_DSAD_DSREGSP_ADRFSP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREGSP,16)))
#define TSB_DSAD_DSREGSP_AD0VRF                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD->DSREGSP,17)))
#define TSB_DSAD_DSTEST0_WR_EN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSTEST0,0)))
#define TSB_DSAD_DSTEST0_MON_EN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD->DSTEST0,1)))




/* Two aspect pulse input counter Mirror */
#define TSB_ENC_MIR0_BCAP00_OVF_MIR00             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC_MIR0->BCAP00,24)))
#define TSB_ENC_MIR0_BCAP10_OVF_MIR10             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC_MIR0->BCAP10,24)))
#define TSB_ENC_MIR0_BCAP20_OVF_MIR20             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC_MIR0->BCAP20,24)))
#define TSB_ENC_MIR0_BCAP30_OVF_MIR30             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC_MIR0->BCAP30,24)))

#define TSB_ENC_MIR1_BCAP00_OVF_MIR00             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC_MIR1->BCAP00,24)))
#define TSB_ENC_MIR1_BCAP10_OVF_MIR10             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC_MIR1->BCAP10,24)))
#define TSB_ENC_MIR1_BCAP20_OVF_MIR20             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC_MIR1->BCAP20,24)))
#define TSB_ENC_MIR1_BCAP30_OVF_MIR30             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ENC_MIR1->BCAP30,24)))


